src/cf/Documents/РегистрацияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РегистрацияВремени</Name>
			<BasedOn>
				<xr:Item>Document.Задача</xr:Item>
				<xr:Item>Catalog.итк_Задача</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Время</xr:Item>
				<xr:Item>AccumulationRegister.Трудозатраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочееВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/РегистрацияВремени/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры
#КонецОбласти

Функция НачатьРаботыПоНаряду(Номер, Пользователь) Экспорт
	
	Результат = новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("Причина","");
	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Наряд.Ссылка КАК Ссылка,
	|	Наряд.ДокументОснование.Клиент КАК Клиент,
	|	Наряд.ДокументОснование.Тема КАК Тема,
	|   Наряд.ФактическоеНачало
	|ИЗ
	|	Документ.Наряд КАК Наряд
	|ГДЕ
	|	Наряд.Ответственный = &Пользователь
	|	И Наряд.ФактическоеНачало <> &ПустаяДата
	|	И Наряд.ФактическоеОкончание = &ПустаяДата";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПустаяДата",'00010101');
	АктивныеНаряды = Запрос.Выполнить().выгрузить();
	Если АктивныеНаряды.Количество() > 0 Тогда
		Результат.Успешно = Ложь;
		Результат.Причина = "Нельзя начинать работу над новым нарядом, если не завершена работа по предыдущему
		|В работе на данный момент наряд по клиенту: "+АктивныеНаряды[0].Клиент+"
		|По задаче: "+АктивныеНаряды[0].Тема+"
		|Начат: "+АктивныеНаряды[0].ФактическоеНачало+"";
		Возврат Результат;
	КонецЕсли;
	
	Наряд = Документы.РегистрацияВремени.НайтиПоНомеру(Номер);
	
	Если Наряд.Пустая() Тогда
		Результат.Успешно = Ложь;
		Результат.Причина = "Наряда с номером "+Номер+" найти в базе не удалось";
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наряд.ФактическоеНачало) Тогда
		Результат.Успешно = Ложь;
		Результат.Причина = "Наряд № "+Номер+" был начат в раньше: "+Наряд.ФактическоеНачало;
		Возврат Результат;
	КонецЕсли;
	
	
	НарядОбъект = Наряд.ПолучитьОбъект();	
	НарядОбъект.ФактическоеНачало = ТекущаяДата();
	НарядОбъект.Записать();
	Возврат Результат;
	
КонецФункции

Функция ЗакрытьНаряд(Данные) Экспорт
	
	ЧтоСделано = Данные.КонтекстСеанса[ПланыВидовХарактеристик.ТелеграмПараметрыКонтекста.Наряд_ЧтоСделано];
	НомерНаряда = Данные.КонтекстСеанса[ПланыВидовХарактеристик.ТелеграмПараметрыКонтекста.Наряд_Номер];
	ЧасыКЗакрытию = Данные.КонтекстСеанса[ПланыВидовХарактеристик.ТелеграмПараметрыКонтекста.Наряд_ЧасыКЗакрытию];
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",Истина);
	Результат.Вставить("Описание","");
	
	Наряд = Документы.РегистрацияВремени.НайтиПоНомеру(НомерНаряда);
	Если Наряд.Пустая() Тогда
		Результат.Успешно = Ложь;
		Результат.Описание = "Наряд с номером "+НомерНаряда+" найти не удалоось";
		
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наряд.ФактическоеОкончание) тогда
		Результат.Успешно = Ложь;
		Результат.Описание = "Наряд "+НомерНаряда+" уже был завершен ранее: "+Наряд.ФактическоеОкончание;
		Возврат Результат;
	КонецЕсли;
	
	ОбъектНаряд = Наряд.ПолучитьОбъект();
	ЗаписьВремени = ОбъектНаряд.РабочееВремя.Добавить();
	ЗаписьВремени.Дата = ТекущаяДата();
	ЗаписьВремени.Комментарий =   ЧтоСделано;
	ЗаписьВремени.Отчет = Число(ЧасыКЗакрытию);
	
	ОбъектНаряд.ФактическоеОкончание = ТекущаяДата();
	ОбъектНаряд.Записать();
	
	Задача = ОбъектНаряд.ДокументОснование;
	ИнформацияОФайле = Новый Структура();
	ИнформацияОФайле.Вставить("Автор", Данные.Пользователь);
	ИнформацияОФайле.Вставить("ВладелецФайлов", Задача);
	ФайлНаДиске = Новый Файл(Данные.ЗагруженныйФайл);
	ИнформацияОФайле.Вставить("ИмяБезРасширения", ФайлНаДиске.ИмяБезРасширения);
	ИнформацияОФайле.Вставить("РасширениеБезТочки", ФайлНаДиске.Расширение);
	ИнформацияОФайле.Вставить("ВремяИзмененияУниверсальное", ОбъектНаряд.ФактическоеОкончание);	
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Данные.ЗагруженныйФайл);
	АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	РаботаСФайлами.ДобавитьФайл(ИнформацияОФайле,АдресФайлаВоВременномХранилище);
	
	
	Возврат Результат;
	
КонецФункции
